src/test/resources/ingest_xml_templates/ingestVOD.xml

<?xml version='1.0' encoding='utf-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:IngestTvinciData>
            <tem:request>
                <userName/>
                <passWord/>
                <data>
                    <!--<![CDATA[-->
                    <feed>
                        <export>
                            <media erase="false">
                                <basic>
                                    <name>
                                        <value lang="eng"/>
                                    </name>
                                    <thumb/>
                                    <description>
                                        <value lang="eng"/>
                                    </description>
                                    <dates>
                                        <catalog_start/>
                                        <start/>
                                        <catalog_end/>
                                        <end/>
                                    </dates>
                                    <pic_ratios>
                                        <ratio ratio="4:3"/>
                                        <ratio ratio="16:9"/>
                                    </pic_ratios>
                                    <media_type/>
                                    <rules>
                                        <geo_block_rule/>
                                        <watch_per_rule>Parent Allowed</watch_per_rule>
                                        <device_rule/>
                                    </rules>
                                </basic>
                                <structure>
                                    <strings/>
                                    <booleans/>
                                    <doubles/>
                                    <dates/>
                                    <metas/>
                                </structure>
                                <files/>
                            </media>
                        </export>
                    </feed>
                    <!--]]>-->
                </data>
            </tem:request>
        </tem:IngestTvinciData>
    </soapenv:Body>
</soapenv:Envelope>